{"data":{"markdownRemark":{"html":"<p>NOTE: New to the Steel Explorer? Read about it <a href=\"/blog/overview-and-usage-of-the-steel-explorer\">here</a>.\n<br/><br/></p>\n<h2>Welcome</h2>\n<p>The purpose of this post is to highlight things that come to mind when reflecting on my time designing, iterating, and building the <a href=\"http://jonsadka.github.io/steel-explorer/\" target=\"_blank\" rel=\"noreferrer noopener\">Steel Explorer</a>. Some are tips, some are tricks, and some are learning lessons. Enjoy!</p>\n<br/>\n<h3>Design thoughts</h3>\n<div style=\"padding-left: calc(1.45rem / 2 + 1.0875rem);\">\n<ul>\n<li>\n<p>Prior to starting the design phase of a new project, try to determine magnitudes, minimums, and maxiumums of your data set. My first iteration of the design for the Steel Explorer only accounted for ~50 beams, but things completley fell apart once all 284 beams were rendered.</p>\n</li>\n<li>\n<p>Design with a minimum screen resolution in mind, driven by actual site statistics if you have them. My initial designs assumed a resolution of 1600px by 900px, which I soon realized only accounted for about 15% of my site traffic. This mistake set me back several weeks and forced me to redesign and reengineer several charts for a screen resolution of 1280px by 768px.</p>\n</li>\n<li>\n<p>When filters are applied to the data, visibly modify elements which do not meet the criteria. For example, beams which are filtered out in the Moment Chart have a reduced opacity and a lighter shade of grey. A transition between states can also assist to make the change less jarring.</p>\n</li>\n</ul>\n</div>\n<div style=\"display: grid; grid-template-columns: 1fr 1fr;\">\n<img src=\"/img/blog-posts/2018-18-12-designing-steel-explorer/filter-before.png\" alt=\"filter-before\" title=\"filter-before\">\n<img src=\"/img/blog-posts/2018-18-12-designing-steel-explorer/filter-after.png\" alt=\"filter-after\" title=\"filter-after\">\n</div>\n<div style=\"padding-left: calc(1.45rem / 2 + 1.0875rem);\">\n<ul>\n<li>Zoom into a filtered dataset to reduce noise from elements which are no longer useful. Do not zoom into a dataset when the context of adjacent elements are useful. For example, zoom is not enabled on filtering for the Distribution Chart because the weight and depth of other beams are useful to see.</li>\n</ul>\n</div>\n<p><img src=\"/img/blog-posts/2018-18-12-designing-steel-explorer/distribution-filter-before.png\" alt=\"distribution-filter-before\" title=\"distribution-filter-before\">\n<img src=\"/img/blog-posts/2018-18-12-designing-steel-explorer/distribution-filter-after.png\" alt=\"distribution-filter-after\" title=\"distribution-filter-after\"></p>\n<div style=\"padding-left: calc(1.45rem / 2 + 1.0875rem);\">\n<ul>\n<li>\n<p>Adding a transition animation when zooming in and out of a chart helps with spatial awareness.</p>\n</li>\n<li>\n<p>Cross linking the charts on filter and hover interactions helps expose additional, potentially relevant, information to the user.</p>\n</li>\n</ul>\n</div>\n<p><img src=\"/img/blog-posts/2018-18-12-designing-steel-explorer/cross-linking-on-hover.png\" alt=\"cross-linking-on-hover\" title=\"cross-linking-on-hover\"></p>\n<div style=\"padding-left: calc(1.45rem / 2 + 1.0875rem);\">\n<ul>\n<li>Use direction (up, down, left, right) in your charts to help make a connection to the physical world. For example, steel beams in the real world are always top aligned and their depths are always measured down. This influenced the design direction of the Distribution Chart [first iteration on left, top aligned iteration on right].</li>\n</ul>\n</div>\n<img style=\"width: 20%; display: inline-block;\" src=\"/img/blog-posts/2018-18-12-designing-steel-explorer/original-distribution-chart.png\" alt=\"original-distribution-chart\" title=\"original-distribution-chart\">\n<img style=\"width: 74%; display: inline-block; float: right;\" src=\"/img/blog-posts/2018-18-12-designing-steel-explorer/flipped-distribution-chart.png\" alt=\"flipped-distribution-chart\" title=\"flipped-distribution-chart\">\n<div style=\"padding-left: calc(1.45rem / 2 + 1.0875rem);\">\n<ul>\n<li>Less is more. Remove elements, labels, legends, titles, etc. you dont need or can be easily inferred by the user. On personal computers, you can leverage the hover animation to expose additional information. My original designs had a dedicated chart showing the beam profile [left figure, bottom left chart], but I soon realized that the beam profile was only relevant when a single beam was selected. The beam profile was de-prioritized as a dedicated chart but appears on hover [right figure].</li>\n</ul>\n<div style=\"display: grid; grid-template-columns: 45% 50%; grid-gap: 30px;\">\n<img src=\"/img/blog-posts/2018-18-12-designing-steel-explorer/isolated-beam-profile.png\" alt=\"isolated-beam-profile\" title=\"isolated-beam-profile\">\n<img src=\"/img/blog-posts/2018-18-12-designing-steel-explorer/joined-beam-profile.png\" alt=\"joined-beam-profile\" title=\"joined-beam-profile\">\n</div>\n<ul>\n<li>When spatially comparing elements, overlaying them on top of one another helps point out small changes. I used this technique to point out differences in beam dimensions when scrubbing through the chart.</li>\n</ul>\n</div>\n<div style=\"display: grid; grid-template-columns: 1fr 1fr; grid-gap: 30px;\">\n<img src=\"/img/blog-posts/2018-18-12-designing-steel-explorer/large-beam-profile.png\" alt=\"large-beam-profile\" title=\"large-beam-profile\">\n<img src=\"/img/blog-posts/2018-18-12-designing-steel-explorer/small-beam-profile.png\" alt=\"small-beam-profile\" title=\"small-beam-profile\">\n</div>\n<div style=\"padding-left: calc(1.45rem / 2 + 1.0875rem);\">\n<ul>\n<li>\n<p>Early in development, be deliberate about supporting mobile. Not every tool needs to support a mobile device and this was one of them. That being said, the Steel Explorer is embarassing on mobile. It's so bad I had to add a banner on mobile devices.</p>\n</li>\n<li>\n<p>Take snapshots of your design iterations along the way. It's makes you realize how much progress you have made and is fun to reminisce on once the project is done. You can see mine <a href=\"#design-evolution\">here</a></p>\n</li>\n</ul>\n<br/>\n</div>\n<h3>Engineering thoughts</h3>\n<div style=\"padding-left: calc(1.45rem / 2 + 1.0875rem);\">\n<ul>\n<li>Voronois are an incredible way to add percise hover animations to charts with lots of elements. Essentially, instead of adding hover events to the elements in the chart, you render a layer of polygons and add a hover event to them. I applied a voronoi hover for all charts in the Steel Explorer. To learn more, I recommed reading Nadieh Bremer's <a href=\"https://www.visualcinnamon.com/2015/07/voronoi\">Using a d3 voronoi grid to improve a chart's interactive experience</a> and exploring Philippe Rivière's <a href=\"https://beta.observablehq.com/collection/@fil/voronoi\">collection of interactive Observables</a>. It's important to point out that using the voronoi technique adds more svg elements to the DOM and can slow down the browser at a certain scale, which will lead me to my next point.</li>\n</ul>\n<p><img src=\"/img/blog-posts/2018-18-12-designing-steel-explorer/voronoi.png\" alt=\"voronoi\" title=\"voronoi\"></p>\n<ul>\n<li>\n<p>Because I underestimated the number of elements being rendered, performance on the transitions is noticably impacted. In retrospect I should have rendred all the charts in canvas and only rendered the voronoi overlays in SVG. This would have dramatically improved the rendering performance, performance when transitioning, and allowed for smoother hover animations. This leads me to my next two points.</p>\n</li>\n<li>\n<p>Computing and rendering the voronoi layer at the scale of data on this project takes a noticable amount of compute power and causes a brief slow down the machiene. This, in conjunction with the transition that happens when a user filters the dataset, resulted in noticable lag because of all the calculations simultaneously. However, I realzied that because the voronoi and svg layer are two independent layers, we can actually delay the re-calculation of the voronoi layer until after the transition of the visual elements have finished. This reduced the lage enough to a point where I felt alright skipping the migration from svg to canvas.</p>\n</li>\n<li>\n<p>When filtering on the data set, it was more performant to hide already rendered elements by changing the opacity to 0 instead of using the enter and exit pattern.</p>\n</li>\n<li>\n<p>You should always clean and condense the data set you are using. Reducing the .csv of steel beam properties from ~2,000 lines to 284 lines reduced the file size from 707kb to 111kb. This easy change improved load time by several thenths of a second.</p>\n</li>\n<li>\n<p>Migrating from d3v3 to d3v5 was relativley painless.</p>\n</li>\n<li>\n<p>I used vanilla JavaScript, CSS and HTML instead of a framework like React or Vue because I thought it would be fun to go back to basics.</p>\n</li>\n</ul>\n</div>\n<br/>\n<h3>Closing</h3>\n<p>I think it's important for you, the reader, to know that I started this project over two years ago and it took a lot of time, hard work, and persitence, just like all the other projects being created and shared. The project had many struggles, many imperfections, many times I wanted to give up, many instances where I felt like I didnt know what I was doing, and many other difficult moments. I provide this color because we make up stories in our mind that the work being created by others happens so effortlessly, easily and quickly, promoting a sense of imposter syndrom within ourselves, when in fact the reality is true. Remind yourself that you are totally capable of achieving whatever goals you set out for yourself as long as you work hard and are persistent. You are awesome.</p>\n<br/>\n<h3 id=\"design-evolution\">Design evolution</h3>\n<p>Below are screenshots of the Steel Explorer at various points in time during the development of the project, in chronological order.</p>","frontmatter":{"date":"1545120000000","path":"/blog/designing-and-engineering-a-visualization-tool-for-structural-engineers","title":"Designing and engineering the Steel Explorer, a visualization tool for structural engineers to select the most efficient beam"}}},"pageContext":{}}