{"data":{"markdownRemark":{"html":"<!-- NOTE: Curious about design and engineering decisions of the Steel Explorer? Read about them [here](/blog/designing-and-engineering-a-visualization-tool-for-structural-engineers) -->\n<h3>What is it?</h3>\n<p><a href=\"http://jonsadka.github.io/steel-explorer/\">Steel Explorer</a> allows Structural Engineers to quickly find the optimal steel beam for their structure in a simple and visually rich way.</p>\n<h3>Usage</h3>\n<p>The tool is made of the following components [Figure 1]:</p>\n<ul>\n<li><strong>[left top] Best Beams</strong>: A result of the three lighetest beams and three shallowest beams which meet the specified criteria. Best beam is on the left.</li>\n<li><strong>[left bot] Second Moment of Area chart</strong>: The Ix value of each beam, grouped by classification (i.e. W<em>XX</em>). Red color denotes the highest weight per in<sup>4</sup> of area.</li>\n<li><strong>[right top] Input Bar</strong>: Beam requrements a user can add to filter out unqualified beams</li>\n<li><strong>[right mid] Available Moment chart</strong>: The strength profile of each beam, calculated using AISC Steel Construction Manual, 15th Edition, <a href=\"https://www.aisc.org/publications/steel-construction-manual-resources#37583\">Design Examples</a></li>\n<li><strong>[right bot] Depth by Weight chart</strong>: Each beam plotted based on it's weight per linear foot and it's depth. Depths are drawn to scale.</li>\n</ul>\n<p>To find the optimal beam, enter your requirements in the Input Bar at the top and watch the Steel Explorer update the charts to show you which beams still satisfy your critera. The Best Beams section will show you the lightest or shallowest beams which match your criteria</p>\n<p><img src=\"/img/blog-posts/2018-26-11-overview-steel-explorer/steel-explorer-usage.png\" alt=\"steel-explorer-usage\" title=\"steel-explorer-usage\">\n<em>Figure 1</em></p>\n<h3>Why build this?</h3>\n<p>Currently, selecting a beam to satisfy a set of structural loads can be calculated by hand (exemplified below) or via computer software. Hand calculations are long and repetitive while existing computer software tools require expensive licenses and are stuck in UI design from the 1990's [Figure 2]. I thought it would be fun to rethink what a mondern-day version of these tools could look like and out came the Steel Explorer.</p>\n<p><img src=\"/img/blog-posts/2018-26-11-overview-steel-explorer/existing-software.png\" alt=\"existing-software\" title=\"existing-software\">\n<em>Figure 2</em></p>\n<h3>Manual selection of a steel beam</h3>\n<p>To understand the value of the Steel Explorer, it's important to provide you with a heavily simplified example of how to size a steel beam by hand. So, let's say you had to design for a steel beam with a minimum strength (Mn) of <strong>1,000 k-ft</strong> and a <strong>12ft span</strong>. You would:</p>\n<ol>\n<li>\n<p>Open the AISC steel manual to Chapter 3, Table 3-10 [Figure 3]</p>\n</li>\n<li>\n<p>Traverese the charts in Chapter 3, Table 3-10 until you fnd the first solid line which crosses or exceedes a value of 1,000 k-ft (y axis) at the 12ft tick (x axis). In this example, it's a W30x99 beam because solid lines denote lighter beams per foot than dashed lines.</p>\n</li>\n</ol>\n<p><img src=\"/img/blog-posts/2018-26-11-overview-steel-explorer/aisc-moment-chart.jpeg\" alt=\"aisc-moment-chart\" title=\"aisc-moment-chart\">\n<em>Figure 3</em></p>\n<p>Now that you've selected a beam, you need to perform a flexural check to make sure the beam does not deflect too much (this would cause saggy floors). To check this, you would:</p>\n<ol>\n<li>Open the AISC steel manual to Chapter 1, Table 1-1 [Figure 4]</li>\n<li>Get several dimenions from the beam and perform the flexural check (I will not bore you with the details)</li>\n<li>See if you meet or exceed the deflection criteria</li>\n</ol>\n<p>If you succeed, congrats. If you dont, you need to choose a different beam and perform the same process all over again. Often this takes multiple iterations.</p>\n<p><img src=\"/img/blog-posts/2018-26-11-overview-steel-explorer/aisc-shape-chart.jpeg\" alt=\"aisc-shape-chart\" title=\"aisc-shape-chart\">\n<em>Figure 4</em></p>\n<h3>The opportunity</h3>\n<p>Instead of iteratively performing these checks and flipping through segmented charts, what if we could simply tell an engineer what the beam is for a given set of requirements?</p>\n<p>The good news is that we can actually do this because the equations used to determine the optimal steel beam are completely determinate. For a given set of requirements we can traverse across all possible beams and solve for the most optimal one without the mess described above.</p>\n<h3>Start exploring</h3>\n<p>Click on <a href=\"http://jonsadka.github.io/steel-explorer/\">this</a> link to take you to the Steel Explorer and select your ideal beam.</p>","frontmatter":{"date":"1543219200000","path":"/blog/overview-and-usage-of-the-steel-explorer","title":"Overview and usage of the Steel Explorer, a visualization tool for sturcutural engineers to select the most efficient beam"}}},"pageContext":{}}